src/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолЧеловека</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФинансирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачисленПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБилета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗачетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедПолисНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедПолисСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Номер, серия. кем выдан, дата выдачи, код подразделения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтудента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСтудента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Студенты/Ext/ManagerModule.bsl
Процедура СтуденческийБилет(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(СтуденческийБилет)
	Макет = Справочники.Студенты.ПолучитьМакет("СтуденческийБилет");

	ДанныеОрганизации = ПолучитьДанныеОрганизации();
	Макет.Параметры.Учредитель = ДанныеОрганизации.Учредитель;
	Макет.Параметры.НаименованиеПолное = ДанныеОрганизации.НаименованиеПолное;
	Макет.Параметры.КраткоеНаименование = ДанныеОрганизации.КраткоеНаименование;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Студенты.Наименование КАК ФИО,
	|	Студенты.ТекущаяПрограммаОбучения Как ПрограммаОбучения,
	|	Студенты.ГодПоступления КАК ГодПоступления,
	|	Студенты.НомерБилета КАК НомерБилета
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	Студенты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Документ = Макет.ПолучитьОбласть("Документ");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ФИОСтруктура = ФамилияИмяОтчество(Выборка.ФИО);
		Документ.Параметры.Фамилия = ФИОСтруктура.Фамилия;
		Документ.Параметры.Имя = ФИОСтруктура.Имя;
		Документ.Параметры.Отчество = ФИОСтруктура.Отчество;
		
		Документ.Параметры.ГодПоступления = Выборка.ГодПоступления;
		
		Если Выборка.НомерБилета <> 0 Тогда 
			Документ.Параметры.НомерБилета = Выборка.НомерБилета;
		КонецЕсли;
		
		Документ.Параметры.ФормаОбучения = НРег(Выборка.ПрограммаОбучения.ФормаОбучения);
		
		//Документ.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Документ, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
    
    Результат = Новый Массив;
    
    // для обеспечения обратной совместимости

    Если ПропускатьПустыеСтроки = Неопределено Тогда
        ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
        Если ПустаяСтрока(Строка) Тогда 
            Если Разделитель = " " Тогда
                Результат.Добавить("");
            КонецЕсли;
            Возврат Результат;
        КонецЕсли;
    КонецЕсли;
    //

    
    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Подстрока = Лев(Строка, Позиция - 1);
        Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
            Результат.Добавить(Подстрока);
        КонецЕсли;
        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
        Позиция = Найти(Строка, Разделитель);
    КонецЦикла;
    
    Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
        Результат.Добавить(Строка);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

Функция ФамилияИмяОтчество(Знач ФИО) Экспорт
    
    СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество");
    
    МассивПодстрок = РазложитьСтрокуВМассивПодстрок(ФИО, " ");
    
    Если МассивПодстрок.Количество() > 0 Тогда
        СтруктураФИО.Вставить("Фамилия", МассивПодстрок[0]);
        Если МассивПодстрок.Количество() > 1 Тогда
            СтруктураФИО.Вставить("Имя", МассивПодстрок[1]);
        КонецЕсли;
        Если МассивПодстрок.Количество() > 2 Тогда
            Отчество = "";
            Для Шаг = 2 По МассивПодстрок.Количество()-1 Цикл
                Отчество = Отчество + МассивПодстрок[Шаг] + " ";
			КонецЦикла;
            Отчество = СокрП(Отчество);
            СтруктураФИО.Вставить("Отчество", Отчество);
        КонецЕсли;
    КонецЕсли;
    
    Возврат СтруктураФИО;
    
КонецФункции

Функция ПолучитьДанныеОрганизации()
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("Учредитель", Справочники.Организации.ОсновнаяОрганизация.Учредитель);
	ДанныеОрганизации.Вставить("НаименованиеПолное", Справочники.Организации.ОсновнаяОрганизация.НаименованиеПолное);
	ДанныеОрганизации.Вставить("КраткоеНаименование", Справочники.Организации.ОсновнаяОрганизация.КраткоеНаименование);
	Возврат ДанныеОрганизации;
КонецФункции
